Revit 2027 API
BuiltInFailures.MEPCalculationFailures.InvalidFluidProperty Property
 Some network components may have a flow value of 0 (zero), due to invalid value settings for fluid Dynamic Viscosity or Density. \nVerify that you have selected the correct fluid type and that the fluid Dynamic Viscosity and Density values are set correctly in the Mechanical Settings dialog.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidFluidProperty { get; }
Public Shared ReadOnly Property InvalidFluidProperty As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidFluidProperty {
	FailureDefinitionId^ get ();
}
static member InvalidFluidProperty : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPCalculationFailures Class
Autodesk.Revit.DB Namespace